app/Controllers/Admin.php

    public function dashboard()
    {
        // Ensure the user is an admin before accessing the dashboard
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/auth/login');
        }

        // Get counts
        $userModel = new UserModel();
        $postModel = new PostModel();
        $data['userCount'] = $userModel->countAll();
        $data['postCount'] = $postModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `posts`

    public function edit($id)
    {
        // Ensure the user is an admin before allowing access to the edit page
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/auth/login');
        }

        $model = new PostModel();
        $data['post'] = $model->find($id);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '525'