app/Controllers/Auth.php

    public function attemptLogin()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Check if the user exists in the database
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'user123'
 LIMIT 1