app/Controllers/Email_cont.php

    public function form()
    {
        // Ensure the user is an admin
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/auth/adlogin');
        }

        $userModel = new UserModel();
        $users = $userModel->select('id, username, email')->findAll();
---
SELECT `id`, `username`, `email`
FROM `users`