app/Controllers/Forum.php

public function edit($id)
{
    $model = new PostModel();
    $post = $model->find($id);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '7'