app/Controllers/Forum.php

    public function index()
    {
        $model = new PostModel();
        $data['posts'] = $model->orderBy('created_at', 'DESC')->limit(15)->findAll();
        $data['total_posts'] = $model->countAll();
---
SELECT *
FROM `posts`
ORDER BY `created_at` DESC
 LIMIT 15
SELECT COUNT(*) AS `numrows` FROM `posts`

public function loadMorePosts()
{
    $offset = $this->request->getGet('offset') ?? 0;
    $limit = 15;
    $page = intval($offset / $limit) + 1;

    $model = new PostModel();
    $posts = $model->orderBy('created_at', 'DESC')->paginate($limit, 'default', $page);
---
SELECT *
FROM `posts`
ORDER BY `created_at` DESC
 LIMIT 30, 15
SELECT COUNT(*) AS `numrows`
FROM `posts`