app/Controllers/SmsController.php

SELECT *
FROM `users`
WHERE `alert_sms_enabled` = 1
AND `phone` != ''
---
    public function sendWaterAlertManual()
    {
        $request = service('request');
        $alertLevel = $request->getPost('alert_level');
        $customMessage = $request->getPost('custom_message');

        if (!in_array($alertLevel, ['warning', 'alert', 'alarm', 'critical'])) {
            return redirect()->back()->with('error', 'Invalid alert level.');
        }

        // Get users with SMS alerts enabled
        $userModel = new UserModel();
        $users = $userModel->where('alert_sms_enabled', 1)->where('phone !=', '')->findAll();