app/Models/UserLocationModel.php

SELECT *
FROM `user_locations`
WHERE `user_id` = '6'
ORDER BY `last_checked_at` DESC
 LIMIT 1
---
    public function getUserLocation($userId)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('last_checked_at', 'DESC')
                    ->first();

INSERT INTO `user_locations` (`user_id`, `lat`, `lon`, `hazard_level`, `last_checked_at`) VALUES ('6', '14.6934096', '121.0998791', 'GREEN', '2025-09-15 08:46:59')
---
    public function updateOrCreateUserLocation($userId, $lat, $lon, $hazardLevel = null)
    {
        $existingLocation = $this->getUserLocation($userId);

        $data = [
            'user_id' => $userId,
            'lat' => $lat,
            'lon' => $lon,
            'hazard_level' => $hazardLevel,
            'last_checked_at' => date('Y-m-d H:i:s')
        ];

        if ($existingLocation) {
            return $this->update($existingLocation['id'], $data);
        } else {
            return $this->insert($data);